Repository: samuelsov/uk.co.vedaconsulting.pcpteams
Catalog: l10n/*/LC_MESSAGES/pcpteams.po
Languages: fr_ca

source: My fundraising pages
fr_ca: Mes pages personnelles de dons

source: Pcp Title
fr_ca: Titre de la page

source: Support of
fr_ca: Événement

source: Goal
fr_ca: Objectif

source: Amount Raised
fr_ca: Montant collecté

source: Manage
fr_ca: Gerer

source: My Teams
fr_ca: Mes pages de dons par équipe

source: Name
fr_ca: Nom d'équipe

source: Team PCP Title
fr_ca: Titre de la page

source: My Role
fr_ca: Mon rôle

source: Leave Team
fr_ca: Quitter l'équipe

source: Team Members
fr_ca: Membres d'équipe

source: You have no new team membership requests yet.
fr_ca: Vous n'avez pas encore de demande pour des nouveau membres d'équipe.

source: New Team Member Requests
fr_ca: Nouvelle demande pour faire partie d'une équipe

source: No new membership requests for your team.
fr_ca: Vous n'avez pas de nouvelle demande pour faire partie d'une de vos équipe.

source: My Pending Team Requests
fr_ca: Mes demandes d'équipe en attente

source: You have no pending membership requests.
fr_ca: Vous n'avez pas de demandes en attente.

source: Archived Pages
fr_ca: Pages archivées

source: You have no archived fundraising pages.
fr_ca: Vous n'avez pas de pages archivées.

source: You do not have any active fundraising pages yet.
fr_ca: Vous n'avez pas encore de pages personnelles de dons.

source: You are not a member of a team yet.
fr_ca: Vous n'êtes pas encore membre d'une équipe.
